"""
config/settings.py

WAAM Global Configuration

프로젝트에서 사용하는 모든 설정값을
한 곳에서 관리한다.

Author : Yunseo Anna Jung 
"""

from pathlib import Path

# ==========================================================
# Project
# ==========================================================

PROJECT_NAME = "WAAM_project"

PROJECT_ROOT = Path(__file__).resolve().parent.parent

# ==========================================================
# Audio
# ==========================================================

SAMPLE_RATE = 44100

CHANNELS = 1

DTYPE = "float32"

# 한 번에 읽는 샘플 수
BLOCK_SIZE = 1024

# 버퍼 길이(초)
BUFFER_DURATION = 2.0

# ==========================================================
# FFT
# ==========================================================

FFT_SIZE = 2048

FFT_WINDOW = "hann"

# ==========================================================
# Mel Spectrogram
# ==========================================================

N_FFT = 2048

HOP_LENGTH = 512

N_MELS = 128

FMIN = 20

FMAX = SAMPLE_RATE // 2

# CNN 입력 크기
MEL_HEIGHT = 128
MEL_WIDTH = 128

# ==========================================================
# Dataset
# ==========================================================

DATASET_DIR = PROJECT_ROOT / "dataset" / "data"

NORMAL_DIR = DATASET_DIR / "normal"

WARNING_DIR = DATASET_DIR / "warning"

DANGER_DIR = DATASET_DIR / "danger"

SAVE_INTERVAL = 0.1

# ==========================================================
# Sound Trigger
# ==========================================================

CHANGE_SCORE_ALPHA = 0.20

# ==========================================================
# Decision Threshold
# (실험 후 수정 예정)
# ==========================================================

WARNING_THRESHOLD = 0.04

DANGER_THRESHOLD = 0.25

# ==========================================================
# Logging
# ==========================================================

PRINT_SCORE = True

PRINT_SAVE = True

# ==========================================================
# PIPELINE
# ==========================================================

PIPELINE_INTERVAL = 0.01

# ==========================================================
# AI
# ==========================================================

MODEL_DIR = PROJECT_ROOT / "models"

AUTOENCODER_MODEL = MODEL_DIR / "autoencoder.keras"

CNN_MODEL = MODEL_DIR / "cnn.keras"

# ==========================================================
# USB (Future)
# ==========================================================

SERIAL_PORT = None

BAUDRATE = 115200

# ==========================================================
# Web (Future)
# ==========================================================

WEBSOCKET_PORT = 8765

# ==========================================================
# Debug
# ==========================================================

DEBUG = True